{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 60, 14],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 150,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "shared_object_id": 1
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": { "gain": 1.0, "seed": null },
            "shared_object_id": 2
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 3
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm",
        "inbound_nodes": [[["input_1", 0, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout",
        "inbound_nodes": [[["lstm", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": [2],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization",
        "inbound_nodes": [[["dropout", 0, 0, {}]]]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_1",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 150,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "shared_object_id": 12
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": { "gain": 1.0, "seed": null },
            "shared_object_id": 13
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 14
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm_1",
        "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_1",
        "inbound_nodes": [[["lstm_1", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [2],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_1",
        "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_2",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 150,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "shared_object_id": 23
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": { "gain": 1.0, "seed": null },
            "shared_object_id": 24
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 25
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm_2",
        "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_2",
        "inbound_nodes": [[["lstm_2", 0, 0, {}]]]
      },
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 5],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_2"
        },
        "name": "input_2",
        "inbound_nodes": []
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "dtype": "float32",
          "axis": [1],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_2",
        "inbound_nodes": [[["dropout_2", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [[["input_2", 0, 0, {}]]]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "name": "concatenate",
        "inbound_nodes": [
          [
            ["batch_normalization_2", 0, 0, {}],
            ["dense", 0, 0, {}]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [[["concatenate", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_2",
        "inbound_nodes": [[["dense_1", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_3",
        "inbound_nodes": [[["dense_2", 0, 0, {}]]]
      }
    ],
    "input_layers": [
      ["input_1", 0, 0],
      ["input_2", 0, 0]
    ],
    "output_layers": [["dense_3", 0, 0]]
  },
  "keras_version": "2.12.0",
  "backend": "tensorflow"
}
